ConfigFiles/Catalogs/ФункцииСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФункцииСистемы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображаетсяВИнтерфейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФункции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФункций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВИнтерфейсе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСвязи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыВходящихСвязейФункций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеОбъектыМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыСервисныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/ВидыВходящихСвязейФункций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыВходящихСвязейФункций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ФункцииСистемы/Forms/ФормаВыбораПотребителя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ПотребляемаяФункция = Параметры.ПотребляемаяФункция;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПотребляемаяФункция", ПотребляемаяФункция);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	ПотребителиВыбраны = Ложь;
	
	ДобавитьСвязи(Ссылки, ПредопределенноеЗначение("Перечисление.ВидыВходящихСвязейФункций.Вход"), ПотребителиВыбраны);
	
	Если Не ПотребителиВыбраны Тогда
		ТекстСообщения = НСтр("ru='Не выбрано ни одной конечной функции для добавления'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОчиститьСообщения();
	
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	ПотребителиВыбраны = Ложь;
	
	ДобавитьСвязи(Ссылки, ПредопределенноеЗначение("Перечисление.ВидыВходящихСвязейФункций.Вход"), ПотребителиВыбраны);
	
	Если Не ПотребителиВыбраны Тогда
		ТекстСообщения = НСтр("ru='Не выбрано ни одной конечной функции для добавления'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДляВхода(Команда)
	
	ОчиститьСообщения();
	
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	ПотребителиВыбраны = Ложь;
	
	ДобавитьСвязи(Ссылки, ПредопределенноеЗначение("Перечисление.ВидыВходящихСвязейФункций.Вход"), ПотребителиВыбраны);
	
	Если Не ПотребителиВыбраны Тогда
		ТекстСообщения = НСтр("ru='Не выбрано ни одной конечной функции для добавления'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДляУправления(Команда)
	
	ОчиститьСообщения();
	
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	ПотребителиВыбраны = Ложь;
	
	ДобавитьСвязи(Ссылки, ПредопределенноеЗначение("Перечисление.ВидыВходящихСвязейФункций.Управление"), ПотребителиВыбраны);
	
	Если Не ПотребителиВыбраны Тогда
		ТекстСообщения = НСтр("ru='Не выбрано ни одной конечной функции для добавления'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Возврат;
	КонецЕсли;
	
	Закрыть();
				  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьСвязь(ФункцияПотребитель, ВидСвязи)
	
	Попытка
		ФункцияПотребительОбъект = ФункцияПотребитель.ПолучитьОбъект();
		ФункцияПотребительОбъект.Заблокировать();
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось заблокировать функцию для изменения. %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ВызватьИсключение(ТекстСообщения);
	КонецПопытки;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Функция",  ПотребляемаяФункция);
	СтруктураОтбора.Вставить("ВидСвязи", ВидСвязи);
	
	МассивСтрок = ФункцияПотребительОбъект.ВходящиеДанные.НайтиСтроки(СтруктураОтбора);
	
	Если МассивСтрок.Количество()=0 Тогда
		
		НоваяСтрока = ФункцияПотребительОбъект.ВходящиеДанные.Добавить();
		НоваяСтрока.Функция = ПотребляемаяФункция;
		НоваяСтрока.ВИдСвязи = ВидСвязи;
		
		ФункцияПотребительОбъект.Записать();
		
	КонецЕсли;
	
	ФункцияПотребительОбъект.Разблокировать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвязи(Ссылки, ТипСвязи, ПотребителиВыбраны)
	
	ВыбранныеФункции = Новый Массив();
	Потребители = Новый Массив;
	
	Для Каждого СсылкаФункции из Ссылки Цикл
		Если ЗначениеЗаполнено(СсылкаФункции) Тогда
			ВыбранныеФункции.Добавить(СсылкаФункции);
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыПотребителей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВыбранныеФункции, "ЭтоГруппа");
	
	Для Каждого ДанныеПотребителя из РеквизитыПотребителей Цикл
		Если Не ДанныеПотребителя.Значение Тогда
			Потребители.Добавить(ДанныеПотребителя.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если Потребители.Количество()>0 Тогда
	    ПотребителиВыбраны = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого Потребитель из Потребители Цикл
		ДобавитьСвязь(Потребитель, ТипСвязи);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
